Tekla.Structures.Model.IAssemblable
The IAssemblable interface dictates which model objects are capabable of belonging to an assembly at the leaf level.

Tekla.Structures.Model.IAssemblable.GetAssembly
Returns the assembly that the assemblable belongs to.
Returns: The assembly that the assemblable belongs to.